-- MySQL dump 10.13  Distrib 8.0.44, for Win64 (x86_64)
--
-- Host: 192.168.0.30    Database: ClassSystenData
-- ------------------------------------------------------
-- Server version	8.4.7

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `teachers`
--

DROP TABLE IF EXISTS `teachers`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `teachers` (
  `teacherID` int NOT NULL,
  `teacherName` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`teacherID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `teachers`
--

LOCK TABLES `teachers` WRITE;
/*!40000 ALTER TABLE `teachers` DISABLE KEYS */;
INSERT INTO `teachers` VALUES (0,'0'),(103,'林君樺'),(105,'陳彥宏'),(106,'席代麟'),(108,'陳盈伶'),(111,'蘇琬婷'),(112,'姚彥淇'),(116,'楊婉琪'),(124,'陳怡禎'),(133,'周昌生'),(136,'郭倩琳'),(138,'張鈺旋'),(142,'薛慧儀'),(144,'邱怡婷'),(157,'李佳馨'),(163,'黃添銓'),(165,'林芳怡'),(169,'盧玉嬴'),(177,'高鳯霞'),(180,'陳冠仰'),(181,'黃秀梨'),(184,'簡靜慧'),(185,'黃文經'),(186,'李仰慈'),(189,'黃慧芬'),(190,'王韻婷'),(203,'范俊銘'),(205,'張琬羚'),(208,'郭心華'),(210,'陳明宜'),(213,'林炫沛'),(219,'邱淑芬'),(223,'洪素英'),(224,'文英'),(226,'郭育誠'),(236,'宋貞儀'),(237,'龔碧菁'),(249,'陳裔專'),(252,'翁仕彥'),(253,'吳大椿'),(259,'尤昭良'),(260,'陳雪霞'),(264,'李馨芬'),(266,'黃渼娟'),(267,'陳柵君'),(268,'李怡賢'),(273,'李林鍵'),(274,'郭麗敏'),(275,'黃俊芳'),(277,'楊靖瑩'),(279,'徐建業'),(287,'陳嫣紅'),(291,'劉曉君'),(294,'陳儀庭'),(297,'蔡鋕鑫'),(298,'王雅慧'),(304,'周光儀'),(305,'李佩珍'),(307,'陳品如'),(308,'薛正中'),(312,'陳思佳'),(313,'吳璦如'),(316,'朱彩鳳'),(321,'簡名豪'),(324,'宋翠葉'),(331,'林佑蓉'),(332,'鄒瑜洳'),(335,'李佩怡'),(338,'柯莉珊'),(350,'周竹宜'),(352,'許振東'),(359,'徐淑貞'),(360,'戴辛翎'),(367,'徐瑋'),(369,'鄭鎧祥'),(373,'陳豐華'),(377,'周玫珍'),(379,'曾育裕'),(381,'蘇哲賢'),(382,'劉遠城'),(386,'李紹瑄'),(392,'陳冠臻'),(393,'王心宜'),(394,'范曉雯'),(401,'王美華'),(402,'祝國忠'),(404,'李曉昀'),(408,'莫淑蘭'),(410,'藍偉雄'),(413,'陳筱妮'),(417,'唐鈺婷'),(418,'陳惠美'),(420,'孫若馨'),(424,'賴世烱'),(427,'吳翠焄'),(430,'陳昭誼'),(433,'張芷菁'),(442,'張君豪'),(443,'黃純文'),(450,'鄭俊雄'),(453,'朱俐蓉'),(458,'侯蘋芮'),(460,'陳郁雯'),(464,'郭堉圻'),(466,'范傑閔'),(469,'廖翊宏'),(473,'田政文'),(474,'劉一凡'),(480,'洪雅琦'),(485,'杜帷希'),(488,'林崇棋'),(490,'吳孟嬪'),(491,'林劍秋'),(497,'李筱苓'),(498,'王詩晴'),(510,'陳冠傑'),(515,'洪子仁'),(520,'陳素秋'),(527,'趙康邑'),(528,'張博雅'),(536,'蔡明憲'),(539,'林依婷'),(540,'林俐吟'),(549,'蔡秀純'),(550,'方昱偉'),(555,'彭晴憶'),(557,'高婕'),(559,'葉馨婷'),(564,'莊士勇'),(566,'張詠雯'),(567,'汪欣怡'),(574,'黃永錚'),(576,'周秋燕'),(580,'曾娓娟'),(586,'簡彥姈'),(589,'蕭慶華'),(594,'熊道芬'),(595,'簡曉莉'),(597,'王麗美'),(598,'陳楚杰'),(599,'沈怡伶'),(602,'林綺雲'),(603,'曾煥棠'),(604,'吳祥鳳'),(605,'臺淑娟'),(606,'李玉嬋'),(607,'陳美蓉'),(611,'劉士榳'),(617,'林和駿'),(618,'林姝含'),(619,'張敬賢'),(644,'張力允'),(653,'林維芬'),(655,'崔道貞'),(656,'林雯霞'),(670,'褚怡菁'),(678,'林聖凱'),(679,'張書璇'),(680,'徐珮倚'),(685,'張昭容'),(691,'葉益吟'),(693,'邢世俊'),(701,'陳瑋苓'),(705,'張崑振'),(706,'宣崇愛'),(708,'楊曉苓'),(709,'江春雪'),(710,'朱詩婷'),(712,'袁秋榮'),(713,'李美銀'),(719,'石雅文'),(723,'顏永豐'),(726,'劉介宇'),(731,'闕瑞紋'),(740,'洪論評'),(750,'王復中'),(752,'趙曜'),(753,'李麗惠'),(755,'許仲南'),(759,'柳舒祥'),(760,'劉信孚'),(764,'鄭金英'),(765,'李梅琛'),(768,'王馥庭'),(770,'林淑雯'),(771,'林君翰'),(774,'謝楠楨'),(785,'林弘斌'),(787,'林進隆'),(788,'梁昭玉'),(789,'黃宣宜'),(790,'吳珮蓉'),(791,'何嘉玲'),(794,'吳孟娟'),(795,'許哲瑋'),(798,'余忠泰'),(799,'林瑋婷'),(800,'蘇美禎'),(802,'陳貞秀'),(803,'林季宜'),(804,'李坤黛'),(808,'林懿苑'),(810,'李慈音'),(811,'楊雅晴'),(812,'范晏郡'),(814,'楊志貞'),(815,'鍾美玲'),(816,'鄭夙芬'),(820,'張寧'),(821,'林英'),(825,'王健珍'),(830,'黃玉文'),(833,'張明真'),(839,'韓惠萍'),(840,'葉美玲'),(842,'蕭勝文'),(843,'林婷茹'),(845,'李嘉雯'),(848,'朱郁文'),(850,'張靜芬'),(851,'羅素'),(852,'張嘉讌'),(853,'陳姿伶'),(854,'邱秀渝'),(860,'梁淑媛'),(866,'湯佳美'),(868,'高千惠'),(871,'林惠如'),(872,'葉明理'),(874,'莊青青'),(876,'沈汀君'),(877,'江逸萱'),(879,'黃馨'),(881,'周雪棻'),(883,'羅明宇'),(884,'宋涵鈺'),(888,'黃俊清'),(889,'涂明香'),(890,'王珏瑋'),(892,'范光中'),(893,'朱唯廉'),(894,'林淑姬'),(895,'劉玟宜'),(897,'朱怡蓁'),(899,'謝雨珊'),(901,'詹偉添'),(903,'何文君'),(905,'古雪貞'),(906,'段慧瑩'),(915,'許兆芳'),(920,'黃君雅'),(930,'方文熙'),(931,'許瑛真'),(942,'譚延綸'),(945,'何思源'),(949,'魏黛如'),(956,'陳俊全'),(957,'王曉萍'),(958,'陳美玲'),(959,'林家弘'),(960,'林曼玲'),(962,'陳香君'),(963,'呂明蕙'),(964,'李春蘭'),(966,'許碧芳'),(969,'李永在'),(970,'張淑芳'),(971,'戴宏達'),(972,'陳柑伴'),(973,'林良憲'),(977,'鄭雅靜'),(981,'郭振宗'),(985,'張啟明'),(993,'黃仲由'),(996,'李文芳'),(1000,'張蘇鈺'),(1002,'陳正芬'),(1006,'彭賢德'),(1007,'梁立芳'),(1009,'黃香香'),(1010,'魏秀靜'),(1015,'李玉霞'),(1017,'林瑛釗'),(1018,'胡文萍'),(1022,'邱慧洳'),(1023,'林秀華'),(1028,'吳秀玲'),(1029,'林文絹'),(1033,'張晉豪'),(1054,'劉孟誠'),(1055,'梁惠玉'),(1060,'戴宇光'),(1061,'鍾昭瑛'),(1062,'蔡衣帆'),(1063,'李威侃'),(1064,'林秀貞'),(1065,'蔡維河'),(1070,'吳旻穎'),(1073,'莊銘中'),(1075,'李靜恬'),(1077,'黃秀玫'),(1078,'楊金寶'),(1081,'廖婉彣'),(1082,'鄧明宇'),(1083,'江慧珠'),(1085,'黃馨慧'),(1090,'沈郁強'),(1091,'陳岱靈'),(1093,'陳紀萍'),(1095,'官千意'),(1096,'謝秀容'),(1097,'施堯啓'),(1101,'蕭世美'),(1106,'廖莉安'),(1107,'王秋雯'),(1108,'楊岳'),(1109,'郭朝揚'),(1110,'馮垂華'),(1113,'朱翠燕'),(1116,'陳維聆'),(1117,'張峰玉'),(1120,'陳琬蓉'),(1121,'王靜慧'),(1122,'李穎俐'),(1123,'蕭偉伶'),(1126,'高玉勳'),(1127,'李慧琪'),(1129,'謝名娟'),(1130,'魏伯全'),(1131,'江怡慧'),(1132,'張宜華'),(1143,'譚漢儒'),(1144,'翁仕明'),(1145,'林梅香'),(1146,'吳孝觀'),(1150,'吳浩婷'),(1152,'朱原嘉'),(1155,'向慧芬'),(1156,'張顯洋'),(1158,'張育通'),(1159,'歐姿秀'),(1160,'巴甫仁'),(1162,'陳香娟'),(1164,'李姵萱'),(1166,'郭麗琳'),(1167,'李榮芬'),(1168,'蔡懿玲'),(1170,'黎靜婷'),(1171,'吳桂花'),(1172,'文郁'),(1176,'區雅倫'),(1177,'馮麗琦'),(1179,'彭庭軒'),(1180,'王佩珊'),(1182,'孫沛婕'),(1183,'翟子睿'),(1185,'余芮瑩'),(1186,'呂國昀'),(1188,'簡崇元'),(1190,'周定衡'),(1193,'陳巧珊'),(1197,'吳承翰'),(1199,'李怡惠'),(1200,'吳孟庭'),(1203,'蔡坤孝'),(1209,'陳建和'),(1212,'黃蘭媖'),(1213,'林佳蓉'),(1214,'施淑鳳'),(1216,'湯幸芬'),(1217,'張家瑜'),(1218,'劉雅芬'),(1219,'林東正'),(1220,'蕭孟蘋'),(1221,'陳書毓'),(1222,'陳稚均'),(1223,'陳綺霞'),(1225,'黃三翁'),(1226,'黃萬翠'),(1227,'鄒昌婷'),(1229,'邱瓊慧'),(1230,'鄭子安'),(1231,'陳妙言'),(1232,'蘇博玄'),(1233,'陳淑溫'),(1234,'林蔚珊'),(1235,'吳怡萱'),(1236,'酒小蕙'),(1237,'柯献堂'),(1238,'許智皓'),(1239,'林郁汶'),(1240,'洪珮真'),(1241,'曾貴祺'),(1242,'黃心蕾'),(1243,'潘愷'),(1244,'黃正銘'),(1245,'周欣婷'),(1246,'0'),(1247,'劉芷菁'),(1248,'潘敏'),(1249,'賴秋伶'),(1250,'鄭秀彬'),(1251,'黎沛姗'),(1252,'賴孟君'),(1253,'陳宏亮'),(1254,'王台欣'),(1255,'李培芬'),(1256,'王淑美'),(1257,'滕安娜'),(1258,'蘇芝庭'),(1259,'曾雅惠'),(1260,'劉吉豐'),(1261,'蘇迺薇'),(1262,'楊宗翰'),(1263,'黃詩婷'),(1264,'許馨心'),(1265,'劉建宏'),(1266,'李惠婷'),(1267,'鄭威'),(1268,'許育弘'),(1269,'廖珮宏'),(1270,'林秀玟'),(1271,'吳秀娟'),(1272,'魏如君'),(1273,'賴倩瑜'),(1274,'蔡宜樺'),(1275,'李慧瑛'),(1276,'許雅玲'),(1278,'李英芬'),(1279,'許承先'),(1280,'林渝苡'),(1281,'賴美祁'),(1282,'翁慧玲'),(1283,'黃士峯'),(1284,'0'),(1285,'艾秀芸'),(1286,'陳世欣'),(1287,'王佳雯'),(1288,'彭康政'),(1290,'黃詩淳'),(1291,'郭蕙琪'),(1292,'林晏如'),(1293,'沈瑞晶'),(1294,'王正航'),(1295,'李安琪'),(1296,'郭哲誠'),(1297,'梁奮鵬'),(1298,'柯明中'),(1299,'0'),(1300,'林孟良'),(1301,'劉清泉'),(1439,'戴君倚'),(1503,'陳亮吟'),(1504,'吳蘭若'),(1609,'黃遵誠'),(1622,'詹庭芳'),(1625,'陳雅娟'),(1629,'陳雅資'),(1670,'李瑜真'),(1824,'陳莉莉'),(1901,'鄧文章'),(1904,'方俊凱'),(1906,'吳庶深'),(1909,'張本聖'),(1919,'劉茹涵'),(8022,'孫源宏'),(8031,'許志怡'),(8034,'謝佳容'),(8040,'童寶娟'),(8048,'蔡君明'),(8052,'李勝文'),(8061,'邱晴薰'),(8063,'連欣怡'),(8065,'藍婉齡'),(8080,'蕭筑棋'),(8083,'李石源'),(8094,'謝志光'),(8095,'曲幗敏'),(8096,'校正興'),(8111,'謝婉馨'),(8117,'鄔恒斐'),(8119,'林昱宏'),(8120,'陳玟霖'),(8129,'李毓涵'),(8331,'何澍'),(8337,'吳承螢'),(8351,'施麗玲'),(8352,'邱恩琦'),(8355,'郭瓈灔'),(8358,'黃瑄湄'),(8363,'吳曉雲'),(8364,'曾虹齡'),(8376,'鄭慧娟'),(8378,'陳宛榆'),(8379,'李奕輝'),(8380,'黃翠華'),(8384,'張宸瑋'),(8385,'李慧貞'),(8397,'翁逸奎'),(8401,'謝亞恆'),(8403,'黃秀麗'),(8406,'慕蓉蓉'),(8407,'廖英壹'),(8408,'高美玲'),(9015,'簡翠薇'),(9019,'劉桂芬'),(9020,'潘婉琳'),(9021,'黃婷婷'),(9023,'王采芷'),(9030,'王雅惠'),(9031,'吳炤華'),(9060,'張智婷'),(9066,'連中岳'),(9074,'陳依兌'),(9080,'孔祥璿'),(9098,'林莉如'),(9104,'許賀湶'),(9114,'陳美如'),(9116,'李俊秀'),(9119,'邱尚志'),(9124,'賴韻如'),(9130,'陳明毅'),(9133,'許均宇'),(9135,'曹健仲'),(9146,'朝日美智代'),(9203,'遲振婷'),(9210,'王凱微'),(9217,'江旻懋'),(9219,'蘇瑞源'),(9225,'胡曉珍'),(9230,'黃資富'),(9236,'李重霈'),(9237,'楊明仁'),(9401,'李明忠'),(9808,'謝宏昇'),(9889,'彭雪英'),(9895,'陳伯瑋'),(9905,'葉昱辰'),(9906,'李坤璋'),(9907,'劉純和'),(9908,'洪芳明'),(9910,'陳致宇'),(9915,'王言梅'),(9925,'陳郁夫'),(9933,'黃如婕'),(9940,'張敏'),(9946,'洪嘉蕙'),(9947,'傅雅萍'),(9952,'盧淑芬'),(9965,'王詩婷'),(9969,'康以諾'),(9971,'曾盈慈'),(9973,'林庭妤'),(9975,'王甄'),(9976,'陳紹韻'),(9986,'葉侃彧'),(9988,'廖世杰'),(9996,'陳亮均');
/*!40000 ALTER TABLE `teachers` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-12-15 13:46:01
